node {
  name: "Train/TrainInput/raw_data"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 999
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 999
          }
        }
        tensor_content: "\364&\000\000\365&\000\000\367&\000\000\370&\000\000\371&\000\000\375&\000\000\376&\000\000\377&\000\000\000\'\000\000\001\'\000\000\003\'\000\000\004\'\000\000\005\'\000\000\006\'\000\000\010\'\000\000\t\'\000\000\n\'\000\000\013\'\000\000\014\'\000\000\r\'\000\000\016\'\000\000\017\'\000\000\020\'\000\000\003\000\000\000)$\000\000\002\000\000\000\004\000\000\000I\000\000\000\212\001\000\000\"\000\000\000V\010\000\000\001\000\000\000\223\000\000\000\024\000\000\000\007\000\000\000\370#\000\000\025\001\000\000\230\001\000\000\004\000\000\000\003\000\000\000\030\000\000\000\002\000\000\000\016\000\000\000\216\000\000\000\005\000\000\000\002\000\000\000Z\025\000\000\001\000\000\000\n\014\000\000=\006\000\000a\000\000\000\003\000\000\000\003\036\000\000\002\000\000\000\004\000\000\000I\000\000\000\212\001\000\000\t\000\000\000R\001\000\000\216\000\000\000\005\000\000\000\256\t\000\000\222\002\000\000{\010\000\000\274\003\000\000\031\000\000\000\n\002\000\000\007\000\000\000\370#\000\000\025\001\000\000\005\000\000\000(\000\000\0000\001\000\000\267\001\000\000e\016\000\000\003\000\000\000\007\000\000\000\257\003\000\000\005\000\000\000O\014\000\000\361\001\000\000\010\001\000\000\006\000\000\000\213\000\000\000\315\027\000\000\222\020\000\000\225\027\000\000\037\000\000\000\335\003\000\000\007\000\000\000\362\000\000\000\371\002\000\000\005\000\000\000\370\003\000\000\343\n\000\000\324\000\000\000\007\000\000\000a\000\000\000\005\000\000\000\260\001\000\000\024\020\000\000\006\000\000\000\017\000\000\000.\000\000\0008\000\000\000\004\000\000\000I\000\000\000\304\000\000\000\335\004\000\000\335\000\000\000\003\000\000\000\001\000\000\000O\014\000\000\003\035\000\000\002\000\000\000\016\000\000\000\325\017\000\000\002\000\000\000\361\001\000\000\017\000\000\000\346\032\000\000\001\000\000\000\002\000\000\000\027\000\000\000r\000\000\000]\n\000\000\205\037\000\000\006\000\000\000\017\000\000\000\253\t\000\000\203\024\000\000\013\000\000\000\321\001\000\0005\000\000\000\275\013\000\000\323\001\000\000\335\004\000\000\020\000\000\000\003\000\000\000\002\000\000\000Q\000\000\000\001\000\000\000\250\000\000\000\005\000\000\000$\000\000\000V\n\000\000\002\000\000\000B\000\000\000\013\000\000\000/\002\000\000\315\027\000\000\367\r\000\000k\007\000\000\233\002\000\000\002\000\000\000\010\000\000\000\034\000\000\000\002\000\000\000\222\020\000\000\225\027\000\000\010\000\000\000\004\000\000\000\003\000\000\000o\001\000\000\271\007\000\000k\014\000\000/\000\000\000\335\000\000\000.\000\000\0008\000\000\000\007\000\000\000)\000\000\000\304\000\000\000\001\000\000\000\324\001\000\000W\001\000\000\r\005\000\000\010\000\000\000F\001\000\000\n\000\000\000$\000\000\000\324\005\000\000\225\003\000\000\005\000\000\000\200\014\000\000\007\000\000\000\010#\000\000t\001\000\000\006\000\000\000v\004\000\000$\000\000\000\204\005\000\000\006\000\000\000\001\000\000\000\263\001\000\000\003\000\000\000\007\000\000\000\002\000\000\000\002\000\000\000\020\000\000\000(\000\000\000\016\000\000\000 \000\000\000\212\001\000\000W\005\000\000\003\000\000\000A\000\000\000\024\001\000\000\202\007\000\000,\000\000\000I\000\000\000\304\000\000\000\236\000\000\000\243\005\000\000\\\t\000\000\005\000\000\000O\014\000\000\317\002\000\000k\000\000\000\240\026\000\000\031\005\000\000\003\000\000\000T\000\000\000\016\000\000\000g\000\000\000O\014\000\000\010\000\000\000\345\000\000\000\276\000\000\000d\000\000\000\003\000\000\000y\005\000\000\002\000\000\000\210\005\000\000\001\000\000\000\335\004\000\0009\000\000\000\030\021\000\000\001\000\000\000\260\001\000\000/\000\000\000X\n\000\000\005\000\000\000k\000\000\000@\001\000\000\021\000\000\000\346 \000\000\005\000\000\000\001\000\000\000\315\027\000\000\367\r\000\000\003\000\000\000A\000\000\000#\000\000\000g\000\000\000v\020\000\000\022\002\000\000\021\000\000\000r\001\000\000>\t\000\000\033\000\000\000\023\000\000\000\206\002\000\000\020\000\000\000.\002\000\000\256\003\000\000\002\000\000\000\005\000\000\000\214\002\000\000\n\000\000\000\002\000\000\000\370\003\000\000\367\002\000\000\003\000\000\000\323\003\000\000\002\000\000\000\223\002\000\000\007\000\000\000\006\003\000\000\005\000\000\000\335\004\000\000\025\000\000\000\001\000\000\000\243\000\000\000\370\003\000\000\367\002\000\000\t\000\000\000\001\000\000\000\377\002\000\000p\006\000\000\005\000\000\000\234\r\000\000U\002\000\000\t\000\000\000\214\002\000\000U\002\000\000\003\000\000\000\001\000\000\000\002\000\000\000\030\004\000\000\020\000\000\000O\014\000\000\031\000\000\000\010\001\000\000\010\000\000\000\376\000\000\000\254\005\000\000H\005\000\000\010\000\000\000\250\001\000\000\217\001\000\000\014\000\000\000\001\000\000\000\225\027\000\000\010\000\000\000\001\000\000\000\013\001\000\000\237\024\000\000\t\000\000\0003\014\000\000\027\000\000\000\007\000\000\000\002\003\000\000l\010\000\000\005\000\000\000\002\000\000\000\010\000\000\000\004\000\000\000\003\000\000\000\025\000\000\000\004\000\000\000\006\000\000\000\004\000\000\000\004\000\000\0001\000\000\000\315\027\000\000\367\r\000\000\027\000\000\000\001\000\000\000\225\027\000\000/\000\000\000\357\000\000\000\001\000\000\000&\000\000\000\020\000\000\000\003\000\000\000\324\000\000\000\004\000\000\000\262\003\000\0009\000\000\000n\005\000\000N\004\000\000\027\000\000\000\001\000\000\000\252\025\000\000\004\000\000\000#\000\000\000\247\010\000\000.\000\000\0008\000\000\000\205\000\000\000\246\001\000\000\001\000\000\000\252\000\000\000*\001\000\000\003\000\000\000[\001\000\000\005\000\000\000\001\000\000\000\003\001\000\000\006\032\000\000\260\001\000\000#\000\000\000\002\000\000\000q\021\000\000\323\000\000\000\205\000\000\000\027\000\000\000y\001\000\000\002\000\000\000\370\003\000\000\003\000\000\000\001\000\000\000Z\001\000\000\005\000\000\000\004\000\000\000\343\n\000\000\025\000\000\000q\035\000\000\002\000\000\0005\024\000\000\370\003\000\000\t\000\000\000\002\000\000\000\031\000\000\000\"\001\000\000\317\000\000\0008\000\000\000\252\000\000\000\001\000\000\000\335\004\000\000\020\000\000\000\003\000\000\000\001\000\000\000\002\000\000\000\237\000\000\000\016\000\000\000\007\000\000\000e\020\000\000\\\007\000\000\324\000\000\000\227\000\000\000\005\000\000\000\372\001\000\0009\000\000\000\253\003\000\000\002\000\000\000q\021\000\000\020\000\000\000\323\003\000\000\002\000\000\000\003\000\000\000\001\000\000\000\371\002\000\000\005\000\000\0005\024\000\000\370\003\000\000\343\n\000\000\324\000\000\000\001\000\000\000\260\001\000\000\023\000\000\000\001\000\000\000|\001\000\000\002\000\000\000\262\006\000\000\217\001\000\000\352\007\000\000\037\005\000\000\006\000\000\000\032\000\000\000\001\000\000\0007\006\000\000\014\000\000\000k\000\000\000O\014\000\000\260\001\000\000\030\021\000\000\010\000\000\000\213\002\000\000\301\027\000\000\241\002\000\000\035\000\000\000\020\000\000\000\003\000\000\000\001\000\000\000\223\001\000\000*\000\000\000\016\000\000\000\000\004\000\000\022\000\000\000\002\000\000\000S\000\000\000\002\000\000\000`\000\000\000\031\000\000\000}\000\000\000<\001\000\000\027\000\000\000\002\000\000\000\006\000\000\000\213\000\000\000\001\000\000\000\222\020\000\000\225\027\000\000\003\000\000\000\001\000\000\000\\\007\000\000\255\002\000\000\"\000\000\000\237\001\000\000\227\000\000\0009\000\000\000\304\007\000\000\013\000\000\000\001\000\000\0006\000\000\000\316\000\000\000/\030\000\000\001\000\000\000K\005\000\000\005\000\000\000O\014\000\000\323\000\000\000\002\000\000\000.\000\000\000\002\000\000\0008\000\000\000\001\000\000\000\367\000\000\000\261\003\000\000\005\000\000\000O\014\000\000\002\000\000\000(\002\000\000\010\000\000\000[\000\000\000p\006\000\000\t\000\000\000>\000\000\000e\006\000\000\323\003\000\000\002\000\000\000\020\000\000\000\003\000\000\000\001\000\000\0006\000\000\000\016\000\000\0007\000\000\000\005\000\000\000\001\000\000\000\006\001\000\000\301\027\000\000S\006\000\000\013\000\000\000\260\000\000\000!\000\000\000#\000\000\000\007\000\000\000\317\000\000\000\344\002\000\000\005\000\000\0000\014\000\000\014\000\000\000\001\000\000\000\236\025\000\000\002\000\000\000\023\025\000\000Y\000\000\000\024\000\000\000\002\000\000\000\013\000\000\000\033\000\000\000\316\030\000\000\024\000\000\000\002\000\000\000\327\000\000\000\006\000\000\000\002\000\000\000\300\010\000\000\002\000\000\000\007\000\000\000\364\007\000\000\005\000\000\000\002\000\000\000\023\000\000\000\001\000\000\000U\002\000\000\005\000\000\000\263\023\000\000\321\005\000\000\005\000\000\000\200\014\000\000\003\000\000\000.\000\000\000\367\000\000\000\002\000\000\000\023\025\000\000\033\000\000\000\002\000\000\000\t\000\000\000\033\000\000\000.\000\000\000N\010\000\000{\005\000\000\022\000\000\000\001\000\000\000\030\013\000\000\323\003\000\000\002\000\000\000\200\017\000\000\003\000\000\000\010\000\000\0006\002\000\000\001\000\000\000=\004\000\000\276\003\000\000/\001\000\000\024\014\000\000\007\000\000\000\262\037\000\000\003\010\000\000\021\000\000\000\360\006\000\000J\000\000\000O\007\000\000\005\000\000\000O\014\000\000\003\000\000\000\022\000\000\000\004\000\000\000\000\002\000\000J\000\000\000\234\005\000\000O\007\000\000\005\000\000\000\002\000\000\000O\014\000\000\"\000\000\000\032\000\000\000\020$\000\000\003\000\000\000,\000\000\000\004\000\000\000\260\001\000\000\023\000\000\000\007\000\000\000\352\007\000\000\013\000\000\000\240\000\000\000\217\001\000\000\014\000\000\000\001\000\000\000\315\027\000\000\225\027\000\000/\000\000\000\024\020\000\000\006\000\000\000O\014\000\000\010\000\000\000\001\000\000\000\237\024\000\000\003\000\000\000k\003\000\000\005\000\000\000\001\000\000\000\352\007\000\000/\000\000\000\017\003\000\000\312%\000\000\374\000\000\000\001\000\000\000\002\000\000\000\031\000\000\000\010\001\000\000\003\000\000\000\260\001\000\000\355\016\000\000}\001\000\000\002\000\000\000\002\000\000\000\005\000\000\000\001\000\000\000\316\013\000\000\222\006\000\000\\\000\000\000\007\000\000\000=\003\000\000\002\000\000\000\237\033\000\000\010\000\000\000\275\014\000\000\t\000\000\000\002\000\000\000\023\025\000\000\t\000\000\000\002\000\000\000\346\006\000\000\001\000\000\000\036\023\000\000\023\025\000\000\010\000\000\000\007\000\000\000\036\003\000\000\010\001\000\000\006\000\000\000\213\000\000\000\225\027\000\000\003\000\000\000\260\001\000\000w\010\000\000\377\036\000\000\005\000\000\000\237\n\000\000\336\034\000\000\013\000\000\000F#\000\000_\000\000\000\250\003\000\000\005\000\000\000\001\000\000\000\352\007\000\000r\000\000\000I\001\000\000\002\000\000\000\306\013\000\000\002\000\000\000\001\000\000\000\301\001\000\000\003\000\000\000T\000\000\000\n\000\000\000g\000\000\000\037\003\000\000\013\000\000\000:\000\000\000\005\000\000\000\227\000\000\000\260\001\000\000\t\000\000\000K\002\000\000\350\024\000\000\002\000\000\000q\021\000\000\020\000\000\000\002\000\000\000c\007\000\000\351\000\000\000G\000\000\000\005\000\000\000\307\004\000\000(\004\000\000\014\000\000\000\002\000\000\000S\000\000\000\002\000\000\000\003\000\000\000\036\000\000\000o\000\000\000#\000\000\000\006\000\000\000N\020\000\000\013\000\000\000\221\000\000\000\273\005\000\000\306\001\000\000\232\002\000\000\004\000\000\000I\000\000\000\304\000\000\000\003\000\000\000\017\000\000\000\037\000\000\000g\000\000\000\335\025\000\000\021\000\000\000\345\000\000\000\336\000\000\000\027\002\000\000F\001\000\000\003\000\000\000\240\003\000\000\021\000\000\000\223\016\000\000P\005\000\000\302\000\000\000a\002\000\000\006\000\000\000\345\010\000\000b\006\000\000\235\006\000\000\013\000\000\000\254\002\000\000K\002\000\000\014\002\000\000\210\001\000\000\342\004\000\000\010\000\000\000\204\000\000\000\255\000\000\000\003\000\000\000\001\000\000\000\305\000\000\000l\024\000\000\001\020\000\000\355\000\000\000\005\000\000\000\001\000\000\000\004\000\000\000\327\r\000\000\302\000\000\000\031\034\000\000\022\000\000\000\002\000\000\000\n\000\000\000\242\000\000\000&\001\000\000\356\000\000\000$\013\000\000\007\000\000\000\002\033\000\000\005\000\000\000\007\000\000\000\371\002\000\000w\001\000\000\006\000\000\000\004\000\000\000\004\000\000\000\025\000\000\000\004\000\000\000\004\000\000\000\014\000\000\000\001\000\000\000|\000\000\000H\001\000\000\334\001\000\000\003\000\000\000\001\020\000\000\240\003\000\000\361\010\000\0000\030\000\000\005\000\000\000\217\005\000\000\t\000\000\000\013\000\000\000\001\000\000\000\t\001\000\000\355\000\000\000\032\004\000\000\014\000\000\000\007\000\000\000)\000\000\000\003\000\000\000\305\000\000\000\374\005\000\000\005\000\000\000\001\000\000\000\302\000\000\000\207\000\000\000\351\002\000\000\002\000\000\000\022\000\000\000\007\000\000\000\021\001\000\000\006\000\000\000\004\000\000\000\254\000\000\000\001\000\000\000\023 \000\000\234\000\000\000\013\001\000\000\216\001\000\000\327\000\000\000\006\000\000\000Y\037\000\000\n\000\000\000\003\000\000\000\226\003\000\000\341\020\000\000\033\000\000\000\265\003\000\000\006\000\000\000\201\010\000\000H\006\000\000\204\000\000\000\255\000\000\000M\000\000\000\'\000\000\000\351\014\000\000\254\002\000\000K\002\000\000\006\000\000\000\232\t\000\000\035\005\000\000\317\000\000\000\255\000\000\000\014\000\000\000\007\000\000\000\226\003\000\000V\001\000\000\003\000\000\000\334 \000\000\341\020\000\000\033\000\000\000\336\003\000\000\007\000\000\000\317\004\000\000\005\000\000\000c\004\000\000\255\000\000\000M\000\000\000\254\002\000\000K\002\000\000Z\000\000\000\216\032\000\000\317\000\000\000\255\000\000\000\276\022\000\000\003\000\000\000\001\000\000\000\305\000\000\000\374\005\000\000\014\000\000\000\302\000\000\000\237\002\000\000W\000\000\000\006\000\000\0007\003\000\000\336\003\000\000\022\000\000\000:\000\000\000\006\000\000\000\032\000\000\000\007\000\000\000\234\007\000\000;\023\000\000M\000\000\000\227\000\000\000K\002\000\000\306\010\000\000\001\000\000\0000\000\000\000N\004\000\000\272\002\000\000\007\000\000\000\362\000\000\000w\001\000\000\014\000\000\000\001\000\000\000)\000\000\000\004\000\000\000\254\000\000\000\003\000\000\000z\013\000\000\020\000\000\000\002\000\000\000\002\000\000\000\002\000\000\000\251\006\000\000\005\000\000\000\242\000\000\000&\001\000\000\356\000\000\000\240\003\000\000^\000\000\000\002\000\000\0005\000\000\000+\002\000\000\236\000\000\000\'\000\000\000\002\000\000\000w\000\000\000M\000\000\000\005\000\000\000\266\000\000\000\260\022\000\000\010\000\000\000\307\003\000\000\204\000\000\000\255\000\000\000\003\000\000\000\001\000\000\000\355\000\000\000\021\000\000\000\340\007\000\000\032\001\000\000f\002\000\000\357\000\000\000\023\000\000\000~\001\000\000\n\000\000\000\301\003\000\000\014\000\000\000\330\001\000\000x\000\000\000\006\000\000\000\004\000\000\000\004\000\000\000\025\000\000\000\004\000\000\000\004\000\000\000\003\000\000\000\346\001\000\000\266\000\000\000\342\004\000\000\010\000\000\000\240\003\000\000u\000\000\000\202\001\000\000\006\000\000\000:$\000\000\014\001\000\000\\\000\000\000\242\000\000\000\302\000\000\000\003\000\000\000\'\001\000\000\005\000\000\000\001\000\000\000\004\000\000\000\327\r\000\000\302\000\000\000\"\006\000\000\022\000\000\000\r\000\000\000\004\000\000\0001\000\000\000\307\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Train/TrainInput/Size"
  op: "Size"
  input: "Train/TrainInput/raw_data"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/floordiv/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "Train/TrainInput/floordiv"
  op: "Div"
  input: "Train/TrainInput/Size"
  input: "Train/TrainInput/floordiv/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul"
  op: "Mul"
  input: "Train/TrainInput/mul/x"
  input: "Train/TrainInput/floordiv"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/strided_slice/pack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/strided_slice/pack_1"
  op: "Pack"
  input: "Train/TrainInput/mul"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/strided_slice/pack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Train/TrainInput/strided_slice"
  op: "StridedSlice"
  input: "Train/TrainInput/raw_data"
  input: "Train/TrainInput/strided_slice/pack"
  input: "Train/TrainInput/strided_slice/pack_1"
  input: "Train/TrainInput/strided_slice/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/Reshape/shape/0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "Train/TrainInput/Reshape/shape"
  op: "Pack"
  input: "Train/TrainInput/Reshape/shape/0"
  input: "Train/TrainInput/floordiv"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/Reshape"
  op: "Reshape"
  input: "Train/TrainInput/strided_slice"
  input: "Train/TrainInput/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/zeros"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 4
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/concat/concat_dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Train/TrainInput/concat"
  op: "Concat"
  input: "Train/TrainInput/concat/concat_dim"
  input: "Train/TrainInput/zeros"
  input: "Train/TrainInput/Reshape"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Train/TrainInput/sub"
  op: "Sub"
  input: "Train/TrainInput/floordiv"
  input: "Train/TrainInput/sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/floordiv_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "Train/TrainInput/floordiv_1"
  op: "Div"
  input: "Train/TrainInput/sub"
  input: "Train/TrainInput/floordiv_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Less"
  op: "Less"
  input: "Train/TrainInput/assert_positive/Const"
  input: "Train/TrainInput/floordiv_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/All"
  op: "All"
  input: "Train/TrainInput/assert_positive/assert_less/Less"
  input: "Train/TrainInput/assert_positive/assert_less/Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "epoch_size == 0, decrease batch_size or num_steps"
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Assert/data_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Condition x > 0 did not hold element-wise: x = "
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Assert/data_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Train/TrainInput/floordiv_1:0"
      }
    }
  }
}
node {
  name: "Train/TrainInput/assert_positive/assert_less/Assert"
  op: "Assert"
  input: "Train/TrainInput/assert_positive/assert_less/All"
  input: "Train/TrainInput/assert_positive/assert_less/Assert/data_0"
  input: "Train/TrainInput/assert_positive/assert_less/Assert/data_1"
  input: "Train/TrainInput/assert_positive/assert_less/Assert/data_2"
  input: "Train/TrainInput/floordiv_1"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "Train/TrainInput/epoch_size"
  op: "Identity"
  input: "Train/TrainInput/floordiv_1"
  input: "^Train/TrainInput/assert_positive/assert_less/Assert"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/range/start"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/range/delta"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/range"
  op: "Range"
  input: "Train/TrainInput/input_producer/range/start"
  input: "Train/TrainInput/epoch_size"
  input: "Train/TrainInput/input_producer/range/delta"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  op: "FIFOQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full_EnqueueMany"
  op: "QueueEnqueueMany"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  input: "Train/TrainInput/input_producer/range"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full_Close"
  op: "QueueClose"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full_Close_1"
  op: "QueueClose"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full_Size"
  op: "QueueSize"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/Cast"
  op: "Cast"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/mul"
  op: "Mul"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/Cast"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full/Train/TrainInput/input_producer/"
      }
    }
  }
}
node {
  name: "Train/TrainInput/input_producer/fraction_of_32_full/ScalarSummary"
  op: "ScalarSummary"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/ScalarSummary/tags"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/fraction_of_32_full_Dequeue"
  op: "QueueDequeue"
  input: "Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Train/TrainInput/input_producer/fraction_of_32_full/fraction_of_32_full"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "Train/TrainInput/mul_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul_1"
  op: "Mul"
  input: "Train/TrainInput/fraction_of_32_full_Dequeue"
  input: "Train/TrainInput/mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice/begin/0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice/begin"
  op: "Pack"
  input: "Train/TrainInput/Slice/begin/0"
  input: "Train/TrainInput/mul_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/Slice/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\024\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice"
  op: "Slice"
  input: "Train/TrainInput/Reshape"
  input: "Train/TrainInput/Slice/begin"
  input: "Train/TrainInput/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul_2/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul_2"
  op: "Mul"
  input: "Train/TrainInput/fraction_of_32_full_Dequeue"
  input: "Train/TrainInput/mul_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Train/TrainInput/add"
  op: "Add"
  input: "Train/TrainInput/mul_2"
  input: "Train/TrainInput/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_1/begin/0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_1/begin"
  op: "Pack"
  input: "Train/TrainInput/Slice_1/begin/0"
  input: "Train/TrainInput/add"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/Slice_1/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\024\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_1"
  op: "Slice"
  input: "Train/TrainInput/Reshape"
  input: "Train/TrainInput/Slice_1/begin"
  input: "Train/TrainInput/Slice_1/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul_3/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "Train/TrainInput/mul_3"
  op: "Mul"
  input: "Train/TrainInput/fraction_of_32_full_Dequeue"
  input: "Train/TrainInput/mul_3/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_2/begin/0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_2/begin"
  op: "Pack"
  input: "Train/TrainInput/Slice_2/begin/0"
  input: "Train/TrainInput/mul_3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Train/TrainInput/Slice_2/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\024\000\000\000\016\000\000\000"
      }
    }
  }
}
node {
  name: "Train/TrainInput/Slice_2"
  op: "Slice"
  input: "Train/TrainInput/concat"
  input: "Train/TrainInput/Slice_2/begin"
  input: "Train/TrainInput/Slice_2/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 14
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/pack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\024\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "Train/Model/zeros/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Train/Model/zeros"
  op: "Fill"
  input: "Train/Model/pack"
  input: "Train/Model/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 20
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/pack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\024\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "Train/Model/zeros_1/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Train/Model/zeros_1"
  op: "Fill"
  input: "Train/Model/pack_1"
  input: "Train/Model/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 20
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/Abs"
  op: "Abs"
  input: "Train/TrainInput/Slice_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 14
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/Sign"
  op: "Sign"
  input: "Train/Model/Abs"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 14
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Train/Model/Sum"
  op: "Sum"
  input: "Train/Model/Sign"
  input: "Train/Model/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Train/Model/Abs_1"
  op: "Abs"
  input: "Train/TrainInput/Slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/Sign_1"
  op: "Sign"
  input: "Train/Model/Abs_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
}
node {
  name: "Train/Model/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Train/Model/Sum_1"
  op: "Sum"
  input: "Train/Model/Sign_1"
  input: "Train/Model/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Model/embedding"
  op: "Variable"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 10001
          }
          dim {
            size: 12
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10001
        }
        dim {
          size: 12
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Model/embedding/Initializer/random_uniform/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Model/embedding"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\021\'\000\000\014\000\000\000"
      }
    }
  }
}
node {
  name: "Model/embedding/Initializer/random_uniform/min"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Model/embedding"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0500000007451
      }
    }
  }
}
node {
  name: "Model/embedding/Initializer/random_uniform/max"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
